app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "email") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save